# 10.2.14 по номеру курса вывести информацию о данном курсе.
# v1 хранение в кортеже
courses = {
    'CS101': (3004, 'Хайнс', '8:00'),
    'CS102': (4501, 'Альварадо', '9:00'),
    'CS103': (6755, 'Рич', '10:00'),
    'NT110': (1244, 'Берк', '11:00'),
    'CM241': (1411, 'Ли', '13:00')
}
s = input()
print('{}: {}, {}, {}'.format(s, *courses[s]))

# v2 хранение в строке
courses = {
    'CS101': '3004, Хайнс, 8:00',
    'CS102': '4501, Альварадо, 9:00',
    'CS103': '6755, Рич, 10:00',
    'NT110': '1244, Берк, 11:00',
    'CM241': '1411, Ли, 13:00'
}
s = input()
print(f'{s}: {courses[s]}')